SESSIONS_DIR = './sessions/' # папка, где лежат session+json файлы, не менять. Для counter.bat (чекер теней) сессии кидаются в sessions_checker, НО...
# ... это должны быть ДРУГИЕ сессии. Т.е. номера могут быть одинаковые, просто нужно повторно для того же списка номеров запустить log to session json, можно даже запустить... 
# ... l.t.s.j. с сессиями в его рабочей папке, он тогда не запросит код но сессию создаст новую. Если сессии будут 1 в 1 (т.е. просто скопировать их в две папки)...
# ... тогда надо чтобы BB_TIME был раньше чем CHECK_TIME, одновременная работа run.bat/monitoring_run.bat и counter.bat будут невозможны
LOG_FILE = './log/main.log' # где main.log - название файла логов
MESSAGES_FILE = './data/messages.txt' # не менять
SYNONYMS_FILE = './data/synonyms.txt' # не менять

ENVELOPE_EMOJI = ["✉️", "📩", "📨", "💌", "💌", "✉", "✉️", "📧", "📨", "📩", "💌", "🖂", "🖃", "💼", "📫", "📬", "📭", "📪", "📮", "📨", "✉️", "✉️"] # не менять

ENVELOPE_TIME_BEFORE_SEND_MESSAGE = 30  # Секунды перед отправкой текста в письмо (30 + рандомно добавляются до 30 секунд сверху)
MAX_ENVELOPE_MESSAGES_ALL_SESSIONS = 1 # Писем перед дизлайками
MAX_LIMIT = 1 # Количество кругов

CHAT_ID = '' # Чат куда отправляются сообщения об успешном запуске
CHAT_ID_rezerv = ''
CHAT_ID_ADMIN = '' # Чат куда отправляются сообщения об успешном запуске + количество сессий в работе + теневые баны + ошибки софта

BOT_TOKEN = '' # @BotFather
PRELAUNCH_MESSAGE_DELAY = 1

BB_TIME = '16:01' # Время когда run.bat/monitoring_run.bat себя выключат сами
CHECK_TIME = '5:23' # Время когда counter.bat будет отправлять проверку на теневые баны в CHAT_ID_ADMIN. Для его работы нужно чтобы в это время был запущен counter.bat
# counter.bat может быть запущен 24/7, а вот run.bat/monitoring_run.bat будут каждый день выключаться, нужно будет запускать занаво
WAKEUP_AFTER_NIGHT = '10:05'

# 52

VERIFICATIONS = './verifs/'

VERIF_UP = VERIFICATIONS + 'up.mp4'
VERIF_DOWN = VERIFICATIONS + 'down.mp4'
VERIF_FIVE = VERIFICATIONS + 'five.mp4'
VERIF_TWIN = VERIFICATIONS + 'twin.mp4'
VERIF_FIST = VERIFICATIONS + 'fist.mp4'
VERIF_ROCK = VERIFICATIONS + 'rock.mp4'
VERIF_FINGER = VERIFICATIONS + 'finger.mp4'

# run.bat - стандартный запуск
# monitoring_run.bat - запуск только режима мониторинга взаимок
# counter.bat - запуск чекера теней
